# The script of the game goes in this file.

# Declare characters used by this game. The color argument colorizes the
# name of the character.

define m = Character("โม",color= "#E55451",what_color="#E55451")

define j = Character("จันหนวดเขี้ยว",color= "#493D26",what_color="#493D26")

define p = DynamicCharacter('player_name', color="#504A4B",what_color="#504A4B")

define n = Character("นเรศ",color= "#1e1e1a",what_color="#1e1e1a")

define mAndn = Character("โม&นเรศ",color= "#614051",what_color="#614051")

define t = Character("หลวงปู่",color= "#ff8c00",what_color="#ff8c00")

define tvm = Character("ชาวบ้าน2",color= "#F62217",what_color="#F6221")

define tvfm = Character("ชาวบ้าน1",color= "#F62217",what_color="#F62217")

define tss = Character("หทารไทย1",color= "#F62217",what_color="#F62217")

define tss2 = Character("หทารไทยทุกคน",color= "#F62217",what_color="#F62217")

define tss3 = Character("หทารยามคนหนึ่ง",color= "#F62217",what_color="#F62217")

define tss4 = Character("ทุกคนในหมู่บ้าน",color= "#F62217",what_color="#F62217")

define mss = Character("หทารพม่า",color= "#F62217",what_color="#F62217")

define po = Character("ตำรวจพม่า",color= "#2B3856",what_color="#2B3856")

define mg = Character("นายพลลึกลับ",color= "#254117",what_color="#254117")

define mmv = Character("ตัวร้าย",color= "#FEFCFF",what_color="#101236")

define mdt = Character("",color= "#FEFCFF",what_color="#101236")

define dkp = Character("???",color= "#FEFCFF",what_color="#101236")

define bd = Character("หัวหน้าโจร",color= "#FEFCFF",what_color="#101236")

define bd1 = Character("โจรด๊อกด๊อย1",color= "#FEFCFF",what_color="#101236")

define bd2 = Character("โจรด๊อกด๊อย2",color= "#FEFCFF",what_color="#101236")

image Timetravel = "Timetravel.png"

image Vlab = "Vlab.JPG"

define x1 = DynamicCharacter("x",color= "#FEFCFF",what_color="#101236")

define mjn = Character("โม&จันหนวดเขี้ยว&นเรศ",color= "#FEFCFF",what_color="#101236")

define hr = Character("หัวหน้านักวิจัย",color= "#4c0470",what_color="#4c0470")
# The game starts here.

label start:#oop

    # Show a background. This uses a placeholder by default, but you can
    # add a file (named either "bg room.png" or "bg room.jpg") to the
    # images directory to show it.
    $ fade = Fade(1.5, 0,0.5) # Fade to black and back.
    $ move = MoveTransition(0.5)
    $ dissolve = Dissolve(1.0)#Function:  Dissolve  
    $ move = MoveTransition(0.5)
    #(time, old_widget=None, new_widget=None, alpha=False):
    scene black
    $ player_name = renpy.input("กรุณาบอกชื่อของคุณด้วยค่ะ?", "อิสระ", length=100)
    if player_name == "":
        $ player_name= "อิสระ"
    "ชื่อของผมคือ  %(player_name)s."   
    # This shows a character sprite. A placeholder is used, but you can
    # replace it by adding a file named "eileen happy.png" to the images
    # directory.
    # These display lines of dialogue.
    play music "bensound-creativeminds.mp3" #Music: https://www.bensound.com
    mdt "นี่คือการอธิบายก่อนที่เราจะเริ่มเกมกันข้างใน**ตัวอย่าง** คือการอธิบาย และข้างใน [ตัวอย่าง]หรือ(ตัวอย่าง)คือการคิดในใจ"
    mdt "ถึงผู้เล่น ทุกคำตอบของคุณจะส่งผลถึงอนาคตที่จะเกิด"
    mdt "หากเข้าใจแล้วก็มาเริ่มกัน!"
    mdt "ในปี27xx ณ ประเทศเมียนมา"
    scene oldlab
    #hide black washington with fade
    
    p "สำเร็จ!! มันได้ผล!!"
    p "ในที่สุดเครื่องย้อนเวลาก็ได้ซักทีหลังจากพยายามมาหลายปี"
    "** เสียงซ่าของจอมอนิเตอร์**"
    p "?!"
    p "เกิดอะไรขึ้นกับจอแสดงผล!"
    scene history
    hide oldlab
    p "อนาคตงั้นเหรอ………..หมายความว่าไง……"
    scene gps
    hide history
    p "[ตัวเลขพวกนี่คืออะไร?]"
    

    scene gps with vpunch
    mdt "ปัง ปัง ปัง! **เสียงเคาะประตู**"
    scene oldlab
    hide gps
    show pol
    po "ในที่สุดก็เจอตัวซักที่ไอ้พวกคนไทยใต้ดิน(พูดในภาษาพม่า)"
    hide pol
    p "ซวยละ พวกมันหาฉันเจอจนได้!!"
    p "ทำไงดีเนี่ย!!"
    show pol
    po "พวกเราล้อมไว้หมดแล้ว ถ้าไม่ยอมออกมาแต่โดยดีจะพังเข้าไปแล้วนะ!(พูดในภาษาพม่า)"
    hide pol
    p "บ้าเอ๋ยไม่มีทางหนีแล้วด้วย"
    p "เหลือแค่ทางเดียวแล้วสิ "
    scene Timetravel with vpunch
    p "ไอ้นี่ฟ้าๆนี่มันคืออะไรเนี่ย? ไม่นะร่วงแล้วๆๆ"
    hide oldlab
    show forest1 with vpunch
    hide Timetravel
    p "เอ๊อะ คึแม่นเจ็บแถะ"
    p "ที่นี่มันที่ไหนเนี่ย?"
    p "**มองที่นาฬิกา**[2307!?]"
    p "แสดงว่าเครื่องย้อนเวลาใช้ได้ผล!"
    "---เปรี๊ย--- "
    show junn
    dkp "เฮ้ย! นั่นใครน่ะ"
    dkp "**เดินเข้าไปหา [player_name]**"
    dkp "อย่าขยับนะเว้ย!"
    p "ใจเย็นครับผมเป็นมิตรนะ!!!!!!!"
    dkp "ฮืม พูดภาษาเดียวกันแสดงว่าคนไทยด้วยกันสินะ"
    p "คนไทย? ประเทศไทยยังมีอยู่อีกเหรอ!!"
    dkp "หมายความว่ายังไง ประเทศไทยก็ไม่เคยหายไปไหนนี่"
    menu:#oop
            "บอกไปว่ามาจากอนาคต":
                jump fj
            "บอกไปว่าหลงทางมาจากเมืองใกล้ๆ":
                jump nv
    label fj:#oop
        p "ฉันชื่อ [player_name] ฉันมาจากอนาคตที่ประเทศไทยได้ล่มสลายไปแล้ว"
        dkp "ฮืม? มาจากอนาคตพูดอะไรของเจ้าน่ะ ฮ่าๆๆ ล้อกันเล่นรึไง แต่ก็เอาเถอะ!"
        jump next
    label nv:#oop
        p "ฉันชื่อ [player_name] ฉันหลงทางมาจากเมืองใกล้ๆน่ะ"
        jump next
    label next:#oop
    dkp "ช่วงนี้เจ้าไม่ควรออกมาจากนอกเมืองของเจ้านะ"
    dkp "เพราะช่วงนี้มันอันตราย พวกพม่ารามัญ ชอบบุกมาบ่อยๆ"
    j "ข้าชื่อจันหนวดเขี้ยว เจ้าเข้ามาหลบภัยอยู่ในหมู่บ้านข้าก่อนสิ"
    p "[จันหนวดเขี้ยว?! นี่เราอยู่หมู่บ้านบางระจันงั้นเหรอ!]"
    mdt "และ จันหนวดเขี้ยวก็พา [player_name] ไปที่หมู่บ้าน"
    scene black with wiperight
    scene villageday2 with wiperight
    p "[นี่หน่ะเหรอหมู่บ้านบางระจัน]"
    hide junn
    show junn
    j "เจ้ารออยู่ตรงนี้ก่อนนะเดี๋ยวข้าขอ เข้าไปคุยกับเจ้าอาวาสเรื่องฝากเจ้าไว้ที่วัดก่อน"
    hide junn
    mdt "ผ่านไปซักครู่หนึ่ง"
    show tammachot
    t "โอ้ โยมคือ โยม[player_name] ที่ โยมจันพูดให้ข้าฟังสินะ"
    p "สวัสดีครับหลวงตา ใช่ครับผม [player_name] เองครับ แล้วนายจันละครับ"
    t "โยมจันเขาไป ลาดตระเวนข้างนอกต่อแล้วหน่ะ"
    t "เอาละ โยม [player_name] มานี่สิอาตมาจะพาไป กุติ"
    p "ครับหลวงตา"
    hide tammachot
    scene insidehomenight
    hide villageday2
    mdt "ในกลางดึกคืนนั้นเองกลางดึก"
    mdt "กุก กัก กุก กัก"
    p "[ฮืมเสียงใครหน่ะ ไปดูดีกว่า]"
    show ban13 at left with move    
    show ban12 at right with move
    
    p "[ใครหน่ะรึว่าจะเป็น ขโมยงั้นเหรอ ไม่ดีแน่ต้องแอบเข้าไปทำมันสลบไปก่อน]"
    show black
    
    hide ban12
    hide ban13
    hide insidehomenight
    show insidehomenight with vpunch
    show ban13 at left with move    
    show ban22 at right with move
    bd1 "** สลบ**"
    p "**แฮ่ก ๆ**"
    mdt "เปรี๊ย"
    bd2 "**กระซิบ** เฮ้ เป็นไรไหมได้ยินเสียงอะไรโครมๆ"
    p "[บ้าเอ๋ย! มันมีเยอะเกินไปตะโกนขอความช่วยเหลือดีกว่าเผื่อมีคนอยู่ใกล้ๆ]"
    p "เฮ้!!!!!ใครก็ได้ช่วยด้วยยย **ตะโกน**"
    scene villagenight
    hide insidehomenight
    hide ban13
    hide ban22
    mdt "เสียงของ [player_name] ได้ดังไปถึงหูของคนที่อยู่แถวนั้นเข้า"
    show mon :
        xalign 0.0
    dkp "นเรศมีคนร้องขอความช่วยเหลือทางกุฏิเร็วเข้าไปช่วยกัน"
    show narasn :
        xalign 1.0 yalign 0.3
    dkp "อื้มรีบวิ่งเร็ว! โม!"
    hide mon
    hide narasn
    mdt "แล้วทั้งสองคนก็วิ่งไปที่กุติ"
    scene insidehomenight
    hide villagenight
    show moan2 :
        xalign -0.1
    dkp "เกิดอะไรขึ้น !!"
    p "แฮ่กๆ [หลบมาตั้งนานในที่สุดก็มีคนมาช่วยมาซักที!]"
    p "ช่วยผมด้วย !! พวกมันเป็นโจรช่วยผมด้วย"
    show narasan :
        xalign 0.0 yalign 0.3
    dkp "มาหลบหลังพวกข้าเร็วๆ !! "
    p "อื้ม!!!"
    mdt "และพวกเธอก็ได้เข้าต่อสู้กับพวกโจร"
    show ban11:
        xalign 0.7
    mdt "แก๊ง ๆๆ ๆๆ **เสียงดาบฟันกันชุดใหญ่**"
    show ban21:
        xalign 1.0
    mAndn "(ทำไมต่อให้ฟันโดนแต่ก็ไม่มีบาดแผลล่ะ)"
    p "[ยันบนหลังของพวกโจรนั่นมันเหมือนกับที่เคยเห็นในหนังสือประวัติศาสตร์เลย]"
    p "[ใช่ยันฟันแทงไม่เข้ารึเปล่านะ]"
    p "พวกเธอเอากระบองทุบพวกมันซิ!!"
    m "นายเป็นใครหน่ะแล้วทำไมฉันต้อง!"
    hide narasan
    show narasan with vpunch:
        xalign 0.0 yalign 0.3
    n "**หยิบกระบองที่ตกอยู่แล้วหวดเต็มแรง**"
    bd "**อั้กก**"
    hide narasan
    hide moan2
    hide ban21
    bd "เห้ยเป็นไปได้ไงกันวะพวกเราไม่ควรเป็นอะไรสิ"
    hide ban11
    n "โม!"
    m "อื้ม!"
    scene fightih
    hide insidehomenight
    mAndn "ฮึบบ"
    scene insidehomenight
    hide fightih
    mAndn "ฟู่ เรียบร้อย "
    mdt "และโจรทั้งสองล้มลงไปกับพื้น"
    show mon :
        xalign 0.0
    show narasn :
        xalign 1.0 yalign 0.3
    p "เดี๋ยวสิพวกเธอมันมีพวกที่หนีไปด้วยนะ อย่าพึ่งวางใจสิเราต้องรีบไปจับพวกนั้น"
    p "[ทางเดียวที่พวกมันจะหนีได้คือทางไหนนะ]"
    p "หลังกุติ พวกนั้นน่าจะหนีไปทางนั้นเพราะเป็นที่ๆมีคนเฝ้าอยู่3คน มันต้องเป็นคนดูลาดเลาแน่ๆ"
    mAndn "เข้าใจละจะลองไปตามที่เจ้าบอกละกัน"
    p "เดี๋ยวผมเองก็ช่วยสู้ได้นะ!"
    hide mon
    hide narasn
    "และ สาวๆ ก็วิ่งไปด้วยกันที่หลังกุติแบบไม่สน[player_name]"
    p "ให้ตายสิไม่ฟังกันเลย"
    mdt "เปรี๊ย"
    mdt "ผ่านไปซักครู่ใหญ่ๆ"
    show mon :
        xalign 0.0
    show narasn :
        xalign 1.0 yalign 0.3
    mAndn "คราวนี้คงเรียบร้อยจริงๆล่ะนะ"
    m "จะว่าไปเจ้าเป็นใครหน่ะ?"
    n "นั่นสิหน้าไม่คุ้นเลยเป็นคนใหม่รึ?"
    p "[จันหนวดเขี้ยวยังไม่ได้บอกรื่องเราให้คนอื่นฟังนี่นาแย่ล่ะต้องรีบอธิบาย  จำได้ว่าตอนนี้เขาคงคิดว่าเราหลงทางสินะ]"
    mdt "[player_name]ได้อธิบายว่าเขามาอยู่ที่นี่ได้อย่างไรให้แก่ ทหารสาวทั้งสองคนฟัง"
    m "เอาเถอะวันนี้ไปพักกันเถอะถ้าเป็นตามที่เจ้าว่าเดี๋ยวพรุ่งนี้"
    m "นายจันคงมาบอกกล่าวพวกเราเองนั่นแหละ"
    m "พวกข้ากลับไปนอนล่ะมันดึกแล้วไปกันเถอะนเรศ"
    n "ข้าเองก็ไปล่ะ"
    hide mon
    hide narasn
    mdt "วันต่อมา"
    scene kuti
    hide insidehomenight
    show junan
    j "**ตะโกน** [player_name]! [player_name]! ตื่นเร็วข้าจะพาเจ้าไปแนะนำกับคนที่เจ้าควรรู้จักในหมู่บ้านนี้"
    hide junan
    show junn
    p "ตื่นแล้วๆไปเดี๋ยวนี้แหละ"
    mdt "เปรี๊ย"
    mdt "หืม เหมือนได้ยินเสียงอะไรหรือเปล่านะ?"
    mdt "แล้วทั้งสองคนก็เดินไปที่หมู่บ้าน"
    scene base
    hide kuti
    j "ที่นี่แหละที่ข้าจะพาเจ้ามา ได้ยินว่าเมื่อวานเจ้าได้ช่วย โมกับนเรศจัดการกับพวกโจรไปนี่"
    p "แล้วคุณอธิบายเรื่องของผมให้พวกเธอฟังรึยังละ"
    j "เรียบร้อยแล้วล่ะและพวกเธอก็อยากพบเจ้าข้าถึงได้พาเจ้ามาที่นี่"
    hide junn
    show junn:
        xalign 0.0
    mdt "ตุบ ตุบ ตุบ (เสียงคนเดินมาจากข้างหลัง)"
    show mon:
        xalign 0.5
    m "โอ้เจ้ามาแล้วเหรอกำลังอยากเจอเจ้าพอดีเลย"
    show narasn:
        xalign 1.3 yalign 0.3
    n "ตื่นสายจริงๆเลยนะเจ้าหน่ะ"
    p "ต้องขอโทษกับเรื่องนั้นด้วยว่าแต่ได้ยินจากนายจัน ว่าพวกเธอต้องการคุยกับผมมีเรื่องอะไรงั้นเหรอ?"
    n "งั้นเรามาเข้าเรื่องกันเลยเจ้าหน่ะสนใจ มาร่วมทัพหน้ากับพวกข้าไหม?"
    j "อืมข้าเห็นด้วยกับพวกเจ้า2คนนะ"
    j "เพราะพวกเรากำลังขาดกำลังทหาร เพื่อต่อกรกับกองทัพของพม่ารามันเสียด้วย"
    j "หมู่บ้านบางระจันของพวกเรานั้น ได้มีคนจากหลายหมู่บ้านใกล้ๆมาหลบอยู่"
    j "เพราะที่นี่เป็นที่มั่นสุดท้ายของพวกเรา ที่จะต่อต้านพม่ารามันและรอกำลังเสริมจากอโยธยา"
    j "แต่ตอนนี้พวกเราถูกพวกพม่ารา มันบุกมาแล้วถึงหกครั้งด้วยกัน"
    j "แต่ก็ยังไม่เห็นวี่แววว่าพวกเขาจะส่งกำลังเสริม มาเลยแต่อย่างไรพวกเราก็จำต้องสู้ด้วยตนเอง!"
    j "แต่ในทุกครั้งเราก็ชนะมาได้ด้วยกำลังของชาวบ้านทุกคนและ"
    j "พวกข้าทั้งสามซึ่งเป็นแม่ทัพในการนำศึกและวางแผนยังไงล่ะ"
    p "แล้วทำไมเหล่าพม่ารามันจึงต้องบุกไทยด้วยล่ะ?"
    j "เพราะว่าหมู่บ้านบางระจันของเราเป็นทางผ่านไปยังอโยธยา"
    j "หากพวกมันไม่สามารถผ่านไปได้ ก็มิมีทางที่จะยกทัพใหญ่เช่นนั้นอ้อมไปได้"
    j "เพราะทางอ้อมนั้นมีป่ามากมายมิสามารถนำช้างศึก"
    j "และเกวียนอาหารที่พวกมันนำมีมาผ่านไปได้"
    p "แล้ว เดี๋ยวสิ ทำไมเหตุผลที่ต้องเป็นผมล่ะ?"
    p "ทำไมถึงอยากให้ผมไปสู้ที่ทัพหน้ากันล่ะ"
    n "เพราะความสามารถในการวิเคราะห์สถานการณ์ของเจ้าเมื่อวานไง"
    m "และทั้งความรู้เรื่องยันของขลังด้วยที่เจ้าช่วยให้เรากำจัด"
    m "เจ้าพวกโจรที่สักยันคงกระพันฟันแทงไม่เข้าได้ยังไงล่ะ"
    n "และอีกอย่างพวกข้าต้องการให้เจ้ามาช่วยพวกข้าในการวางแผนการรบ"
    n "และช่วยระวังหลังของพวกข้าด้วย เพราะพวกเราต้องเตรียมการสู้กับพวกพม่ารามัญยังไงล่ะ"
    p "แต่ผมไม่ได้แข็งแรงเท่าๆกับพวกคุณหน่ะสิ"
    hide junn
    show junsh:
        xalign 0.0
    j "โฮ่ ๆ **ลูบหนวด** ไม่ต้องห่วงพวกเราจะช่วยฝึกเจ้าให้เอง"
    p "งั้น**คิดซักพัก** ก็จะลงองดูแล้วกันนะ !! "
    hide junsh
    hide narasn
    hide mon
    scene training with wipedown
    hide base
    j "จงจำการฝึกนี้ให้ดีละ!"
    p "ได้เลย"
    scene training with vpunch
    j "เดี๋ยวเจ้าต้องไปฝึกต่อกับโมและนเรศด้วย!"
    p "ได้ครับ!!"
    scene train2 with wipedown
    hide training
    n "ตั้งใจฝึกซะ! [player_name]"
    p "ครับ!!"
    scene train2 with vpunch
    n "ต่อไปฝึกกับโมสินะสู้เขาละ[player_name]"
    scene train3 with wipedown
    hide train2
    m "ออกแรงมากกว่านี้หน่อยสิ[player_name]!"
    p "ครับผม!!"
    scene train3 with vpunch
    m "อืมพอได้นะ[player_name]แต่ต้องฝึกแบบนี้อีก7วันนะ"
    p "ห่ะ หาาาาาาา"
    m "ระหว่างนั้นพวกข้าจะประชุมกันเรื่องการสู้และคาดการณ์ เวลาคร่าวๆที่พวกพม่ารามัญจะเข้ามา"
    scene kuti
    hide train3
    mdt "7วันผ่านไปไวเหมือนโกหก"
    mdt "หลังจากที่[player_name]ฝึกอยู่คนเดียวไปซักพัก"
    mdt "ตึกๆๆๆ ** เสียงคนเดินมาจากทางข้างหน้า**"
    show mon :
        xalign 0.0
    show narasn :
        xalign 1.0 yalign 0.3
    n "อ้าวเจ้าพักหายเหนื่อยแล้วงั้นเหรอ?"
    p "อื้มแล้วพวกเธอล่ะประชุมได้เรื่องกันว่ายังไง"
    m "ก็จากที่พวกข้าคาดการไว้ใน3-4วันนี้พวกพม่ารามังอาจจะบุกมาได้"
    hide mon 
    show mosa:
        xalign 0.0
    m "พวกเรายังมิได้เตรียมแผนใดๆไว้รับมือเลยคงต้องหวังพึ่งเจ้าแล้วละ"
    hide mosa
    show mon :
        xalign 0.0
    show narassa:
        xalign 1.0 yalign 0.3
    n "เรื่องนั้นเราจะคุยกันวันพรุ่งนี้ละนะ"
    n "จะว่าไปนายอยากไปลองเดินตรวจตรากับพวกเราไหม?"
    p "ก็ได้นะเพราะว่าตอนนี้ผมก็ว่างอยู่ด้วย"
    m "งั้นก็ไปตรวจตรากันเถอะะ **ลากแขนที่งสองคน**"
    "[player_name]&นเรศ" "ม่ะ ไม่ต้องลากก็ได้น่าา "
    
    scene forest2day
    hide kuti
    hide mon
    hide narassa
    show mon :
        xalign 0.0
    show narassm:
        xalign 1.0 yalign 0.3
    mdt "ทั้งสามคนเดินไปรอบๆหมู่บ้านและคุยกันอย่างสนิทสนม"
    mdt "และนระหว่างที่เดินอยู่โมและนเรศก็ได้เริ่มตั้งคำถามขึ้นมา"
    m "นี่[player_name]นายว่าการรบนี่เราควรรบตอนกลางวันหรือตอนกลางคืนงั้นเหรอ?"
    menu:#oop
            "ตอนกลางวันสิก็เป็นการรบนี่ถ้ามืดมันก็ไม่ยุติธรรมหน่ะสิ":
                jump fool
            "ตอนกลางคืนสิเพราะเราได้เปรียบกว่าตั้งเยอะ":
                $ heart_m += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                jump nighttime
    label fool:#oop
        hide mon
        show mosa: 
            xalign 0.0
        m "แต่ข้าว่าตอนกลางคืนดีกว่านะเพราะเราเองก็มีกำลังรบจำกันด้วยสิ"
        n "ข้าเห็นด้วยเลยตอนกลางคืนได้เปรียบกว่าเห็นๆ"
        p "งะ งั้นเหรอ"
        jump next2
    label nighttime:#oop
        hide mon
        show mosm: 
            xalign 0.0
        m "ใช่ไหมๆได้เปรียบกว่าตั้งเยอะเลยเนาะ"
        n "ข้าเองก็ว่าเช่นนั้น"
        jump next2
    #label late:
       # hide mon
        #show mosa: 
        #    xalign 0.0
        #m "...ไม่แน่ใจงั้นเหรอแต่ก็เอาเถอะ"
        #n "มีความมั่นใจขึ้นอีกหน่อยนะเจ้าหน่ะ"
        #m "แต่ยังไงเราก็ต้องรบตอนกลางคืนละนะเพราะมันทำให้เราได้เปรียบกว่าเยอะเลย"
        #p "อะ อื้มนั่นสิขอโทษด้วยพอดีกำลังคิดอยู่หน่ะแต่ก็นะ"
        #jump next2
    label next2:#oop
    hide mosa
    hide mosm
    show mon: 
        xalign 0.0
    n "อื้มแล้ว[player_name]"
    n "ถ้าหากเรารบตอนกลางคืน"
    n "เจ้ามีวิธีที่เราจะส่งสัญญาณให้ทหารทุกคนเข้าจู่โจมพร้อมกันไหม?"
    menu:#oop
            "ก็ใช้สัญญาณมือสิ!":
                jump fool2
            "ไม่ลองใช้พลุล่ะ?":
                $ heart_n += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                jump FireWork
    label fool2:#oop
        hide narassm
        show narassa:
            xalign 1.0 yalign 0.3
        n "แต่เวลารบในตอนกลางคืนมันมองไม่เห็นซักหน่อยนี่นา"
        m "อื้มม อยากให้มีอะไรที่ส่งสัญญาณได้ได้จังน้าาาา"
        p "[จริงสิพลุไงเดี๋ยวไปลองทำดูดีกว่า!]"
        jump next3
    label FireWork:#oop
        n "พลุู?มันคืออะไรงั้นเหรอ?"
        p "คล้ายๆกับปืนใหญ่ขนาดเล็กที่มีแต่เสียงกับแสงหน่ะ"
        m "งั้นก็ใช้ได้เลยนี่!!ว่าแต่จะหามันจากไหนละ"
        p "[จริงสิเราทำพลุเองได้นี่นาจำได้ว่าเราเคยอ่านเจอในหนังสือ]"
        jump next3
    label next3:#oop
    hide narassm
    show narasn:
        xalign 1.0 yalign 0.3
    p "ผมคิดว่าผมผมคิดออกแล้วล่ะแต่ขอเก็บไว้เป็นความลับก่อนแล้วกันนะ"
    m "งั้นพวกข้าจะวางใจเจ้าแล้วกันนะ"
    n "ข้าเองก็ด้วยถ้าเจ้าว่าเช่นนั้น"
    m "แล้วระหว่างดาบยาวกับดาบคู่เจ้าชอบอะไรมากกว่ากันงั้นเหรอ?"
    menu:#oop
            
            "ดาบยาวแน่นอนอยู่แล้ว!":
                $ heart_m += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                jump long
            
            "ก็ต้องดาบสองมือหน่ะสิ!":
                $ heart_n += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                jump short
            "อันไหนก็ได้ทั้งนั้นแหละ":
                jump fool3

    label long:#oop
        hide mon
        show mosm: 
            xalign 0.0
        m "ข้าเองก็ชอบมันเหมือนกันใช้ถนัดมือดีด้วย!"
        hide narasn
        show narassa:
            xalign 1.0 yalign 0.3 
        n "งั้นเหรอ.."
        jump next4
    label short:
        hide narasn
        show narassm:
            xalign 1.0 yalign 0.3 
        n "เห็นไหมถ้าบอกแล้วว่าเขาต้องชอบดาบคู่สุดเท่หน่ะ"
        hide mon
        show mosa: 
            xalign 0.0
        m "ทำไมลพดาบยาวมันไม่เท่ตรงไหนกัน **โมเศร้านิดเหน่อย**"
        p "เปล่าหรอกอย่าเสียใจไปเลยแค่ผมชอบเพราะมันถนัดกว่านะ"
        hide mosa
        show mon: 
            xalign 0.0
        m "งั้นเหรอ"
        p "อื้ม!!"
        jump next4
    label fool3:
        m "งั้นเหรอเจ้าเป็นประเภทที่อันไหนก็ได้สินะ"
        n "ไม่มีอันที่ชอบจริงๆงั้นเหรอ?"
        p "ก็นะแค่มีใช้ก็พอนี่ ทำไมล่ะ?"
        m "ไม่หรอกช่างมันเถอะๆ"
        jump next4
    label next4:
    hide narassm
    hide mosm
    hide narassa
    hide mon
    hide narasn
    "และเวลาก็ค่อยๆผ่านไปจนค่ำ"
    scene forest2night
    show narasn:
        xalign 1.0 yalign 0.3
    show mon:
        xalign 0.0
    hide forest2day
    n "จริงสิๆ นี่ [player_name]เจ้าว่าผูหญิงนี่ผมยาวกับสั้นแบบไหนดีกว่ากันงั้นเหรอ?"
    m "จริงด้วยข้าเองก็อยากรู้นะ!"
    menu:#oop

            "ผมคิดว่าผมยาวดูดีกว่านะ":
                $ heart_n += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                jump longhair
            "ผมคิดว่าผมสั้นดูดีกว่านะ":
                $ heart_m += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                jump shorthair
            "ผมคิดว่ามันก็น่ารักทั้งคู่นั่นแหละนะ":
                $ heart_n += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                $ heart_m += 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                jump greeder
    label shorthair:
        hide mon
        hide narasn
        show mosh:
            xalign 0.0
        show narassa:
            xalign 1.0 yalign 0.3
        m "จะ จริงเหรอ"
        jump next5
    label longhair:
        hide mon
        hide narasn
        show mosa:
            xalign 0.0
        show narassh:
            xalign 1.0 yalign 0.3
        n "ยะ อย่างงั้นเหรอ"
        jump next5
    label greeder:
        hide mon
        hide narasn
        show mosh:
            xalign 0.0
        show narassh:
            xalign 1.0 yalign 0.3
        m "จะ จริงเหรอ"
        n "ยะ อย่างงั้นเหรอ"
        jump next5
    label next5:
    hide mosh
    hide narassh
    hide narassa
    hide mosa
    show mon:
        xalign 0.0
    show narasn:
        xalign 1.0 yalign 0.3
    m "ตอนนี้มันก็ค่ำแล้วได้เวลาเปลี่ยนกะแล้วล่ะเรากลับกันเถอะ"
    n "อื้มเข้าใจล่ะ"
    p "ในที่สุดก็ถึงเวลาพักแล้วสินะะะ"
    mdt "และระหว่างทางกลับพวกเขาก็ได้พูดคุยกัยเกี่ยวกับแผนการรบ"
    scene villagenight
    hide forest2night
    hide mon
    hide narasn
    show mon:
        xalign 0.0
    m "แผนที่เจ้าว่ามาก็ใช้ได้นะเจ้านี่มันฉลาดสุดๆไปเลยนี่นา"
    show narasn:
        xalign 1.0 yalign 0.3
    n "เห็นด้วยเลยล่ะว่าแต่ทำไมเข้าถึง รู้จำนวนศัตรูคร่าวๆที่จะมาในครั้งต่อได้กันล่ะ"
    n "แถมทั้งเรื่องยันต์ต่างๆที่เจ้าเล่าให้พวกข้าฟังอีก"
    p "พอดีผมเคยเรียนเรื่องยันมาก่อนแต่ยังไม่เคยสักเลยซักครั้ง"
    p "ส่วนเรื่องจำนวนศัตรูผมคิดว่าในตอนนี้ แม่ทัพอีกฝั่งจะต้องรู้สึกหัวเสียอย่างมากแน่ๆ"
    p "เพราะจากที่พวกเธอเล่าให้ผมฟัง แล้วพวกพม่ารามันได้บุกมาแล้วถึง6ครั้ง"
    p "แต่ก็ทัพของพวกมันพ่ายทุกครั้งไป เพราะงั้นครั้งนี้จะตั้งยกทัพมาเป็นจำนวนมากกว่าเดิมแน่"
    n "อย่างที่ข้าคิดเลยว่าเจ้าหน่ะเหมาะแก่การ เป็นแม่ทัพและคนคอยระวังหลังให้พวกเราจริงๆ"
    m "อืมๆ ใช่เลยเราต้องการคนแบบนี้แหละมาระวังหลังให้พวกเรา"
    p "[เอาไงดีนะ]"
    p "เอางั้นก็ได้ ผมจะไปทัพหน้ากับพวกคุณ!!"
    p "[ตามประวัติศาสตร์ในยุคเราหมูบ้านบางระจัน ชนะศึกกับพม่าดังนั้นถ้าเราไปด้วยกับพวกเธอคงไม่เป็นไรหรอกมั้ง]"
    hide mon
    hide narasn
    mdt "ในคืนวันนั้นเอง"
    scene basenight
    hide villagenight
    show tvm1 :
        xalign 1.0
    tss "จันหนวดเขี้ยวฝ่ายสอดแนมของเราได้ข้อมูลมาแล้ว!"
    show junan:
        xalign 0.0
    j "จริงงั้นหรือ!!ข่าวว่าเยี่ยงไรล่ะ!!"
    tss "ครั้งนี้พวกมันมีกองทัพจำนวนหนึ่งพันเศษ!"
    hide junan
    show junn:
        xalign 0.0
    j "งั้นรึงั้นเราคงต้องเร่งประชุมแผนการรบแล้วล่ะ"
    j "ตอนนี้พวกมันเดินทางมาถึงที่ใดแล้วล่ะ"
    tss "พวกมันน่าจะมาถึงที่ราบใกล้ๆเพื่อตั้งแคมป์ในเวลา4-5วัน"
    tss "หากเป็นไปตามที่ฝ่ายสอดแนมของเราแจ้งมา"
    j "เข้าใจล่ะงั้นพรุ่งนี้เช้าตรู่เราจะเรียกประชุมใหญ่!"
    mdt "ตุบ ๆ ๆ ๆ **เสียงเดินมาจากหน้าประตู**"
    p "ไม่ถึงกับต้องเรียกประชุมหรอก"
    p "เรื่องเมื่อกี้ผมได้ยินแล้วและพอคิดแผนคร่าวๆออกแล้ว"
    j "เจ้ามาตั้งแต่เมื่อไหร่กัน[player_name] ฝีมือพัฒนาขึ้นแล้วนี่สมแล้วที่พวกเธอฝึกเจ้ามา"
    p "เดี๋ยวผมจะอธิบายแผนให้ฟังแต่ว่า ……**เงียบไปแว้บหนึ่ง**"
    p "ผมขอรู้เรื่องจำนวนทหารที่เรามีหน่อยสิจันหนวดเขี้ยว"
    j "กองกำลังน่ะเหรออืมม**และเขาก็เงียบไปเพื่อคิดซักพักหนึ่ง**"
    tss "เดี๋ยวก่อนจันหนวดเขี้ยว เจ้านี่คือใคร"
    tss "เราจะบอกข้อมูลของเราให้คนนอกรู้ไม่ได้นะ!!"
    hide junn
    show junsm:
        xalign 0.0      
    j "เอาน่าๆหมอนี่ไม่ใช่ชาวพม่าหรอก"
    j "แล้วหมอนี่ก็ไม่มีทางเป็นไส้สึกด้วย"
    j "ดูสิแววตาของหมอนั่นหน่ะ แค่มองก็รู้แล้ว ว่าเป็นคนที่รักชาติขนาดไหน"
    hide junsm
    show junn:
        xalign 0.0
    tss "**จ้องไปที่หน้าของ [player_name]**"
    hide tvm1
    show tvm2:
        xalign 1.0
    tss "งั้นรึถ้าเจ้าว่าแบบนั้นข้าก็จะลองเชื่อดูละกัน"
    j "เรามีพลหารปืน จำนวนสองร้อยเศษๆ"
    j "และมีพลทหารทั่วๆไปอีกประมาณเกือบ1200คน"
    p "อืม งั้นเราต้องหาวิธีที่เสียคนน้อยที่สุดและรวดเร็วที่สุดสินะ"
    j "อืมงั้นเอาตามที่เจ้าว่าลองไปคิดแผนมาดูสิ"
    j "ข้าเองก็จะไปคิดมาเช่นกันแล้วเราจึง เอามาบอกให้ทุกคนทราบทั่วกันในวันพรุ่งนี้เช้าตรู่"
    p "อืมก็ดีนะงั้นเดี๋ยวเรามาเจอกันวันพรุ่งนี้"
    hide tvm2
    hide junn
    scene base
    hide basenight
    mdt "วันต่อมาเวลาเช้าตรู่"
    mdt "**แก๊ง ๆ** เสียงระฆังในยามเช้าตรู่ดังขึ้น เป็นสัญญาณเรียกให้แม่ทัพทุกคนมาระดมกัน"
    show junn:
        xalign 0.0 
    j "เอาล่ะโมนเรศเราจะมาคุยกัน เรื่องแผนการรบในวันนี้เดี๋ยวเราจะให้[player_name]เป็นคนนำนะ"
    show mon:
        xalign 0.5 
    show narasn:
        xalign 1.3 yalign 0.3
    p "เอาหละหลังจากที่ได้ยินข้อมูลโดยละเอียด"
    p "ผมคิดว่าเราควรให้พลแม่นปืนคอยป้องกันทัพทหารม้าข้องพม่า"
    p "และพวกเรานำทัพ เพียง 1000 คนไปตีและล้อมค่ายของพวกมันไว้"
    p "โดยเราต้องรีบจัดการในเร็ววันก่อนที่พวกมันจะจัดค่ายเสร็จ"
    p "และชิงพื้นที่ได้เปรียบไป และนอกจากนั้นหากเราไปทันก่อนที่พวกมันจะตั้งค่ายเสร็จ"
    p "พวกเรายังสามารถลอบตีพวกพม่ารามันจาก ทางหลังค่ายที่มีทหารยามอยู่น้อยได้ด้วย"
    p "ในครั้งนี้เราต้องทำความเสียหายให้มากที่สุดเพื่อข่มขวัญพวกมัน"
    p "เราจะได้มีเวลาในการเตรียมตัวสำหรับครั้งต่อๆไปด้วย"
    p "[ถึงมันจะมีการรบกับพม่ารามัญแค่8ครั้งก็เถอะ]"
    p "[เพราะหลังจากศึกครั้งนี้ถ้าผมจำได้จำไม่ผิด เราก็จะชนะในครั้งที่8และบุกไปตีพม่ารามันจนแตกพ่ายอยู่ดี]"
    m "**กระซิบ**แผนเดียวกับที่เล่าให้พวกข้าฟังตอนไปเดินตรวจตราด้วยกันเลยนี่"
    n "**กระซิบ**นี่เจ้ารู้ข่าวก่อนฝ่ายสอดแนมอีกงั้นเหรอทำได้ยังไงกันหน่ะ"
    p "**กระซิบ**แค่บังเอิญน่า" 
    j "กระซิบการะซาบอะไรกันรึ?"
    p "ม่ะ ไม่มีอะไรหรอกว่าแต่จันหนวดเขี้ยวเจ้ารู้เรื่องรึยังล่ะ?"
    j "รู้อะไรรึ?"
    n "[player_name]หน่ะจะมาคอยระวังหลังให้พวกเราที่ทัพหน้าไงล่ะ"
    m "ใช่แล้วแล้วและถ้ามีปัญหาเฉพาะหน้า"
    m "ความฉลาดของ[player_name]ต้องช่วยเราได้แน่ๆ"
    p "นี่อย่าคาดหวังกันขนาดนั้นสิ"
    j "ไม่หรอกข้าว่าเจ้าทำได้แน่เจ้าต้องเป็นหนึ่งในแม่ทัพที่ดีแน่"
    j "แน่พวกเราฝึกเจ้าเองถึงจะเป็นเวลาไม่กี่วันแต่ฝีมือเจ้านั้นพัฒนาเร็วมาก"
    p "**เขิน** อย่าชมกันขนาดนั้นสิ"
    j "เอาเถอะตอนนี้เราต้องรีบไปแจ้งให้ทุกคนทราบและรู้แผนการใหม่ของเรา!!"
    hide mon
    hide narasn
    hide junn
    mdt "**แก๊งๆๆๆๆ** **และซักพักหนึ่งเสียงระฆัง เรียกให้ทุกคนในหมู่บ้านมาประชุมกันก็ดังขึ้น**"
    mdt "**เพื่อเรียกทุกคนและจันหนวดเขี้ยวก็ได้ประกาศ ตำแหน่งหัวหน้าทัพของผมกับแผนการของเราให้ทุกคนฟัง**"
    mdt "หลายวันผ่านไป"
    scene forest4
    hide base
    show junn:
        xalign 0.0 
    j "เป็นไง[player_name]เจ้าตื่นเต้นไหมในการเป็นเข้ารบครั้งนี้"
    p "แน่นอนสิก็มันครั้งแรกของผมนี่นา!!"
    j "งั้นแปลว่าเจ้าไม่เคยฆ่าคนมาก่อนงั้นรึ?"
    p ".......ก็เปล่าหรอก"
    p "[ก็นะเพื่อให้หลบหนีตำรวจพวกนั้นได้บางครั้งเราก็จำเป็นต้องฆ่า]"
    p "[เพราะถ้าไม่ฆ่าเราก็ต้องถูกจับไปเป็นทาสแบบคนไทยคนอื่นๆ...ในประเทศพม่า]"
    j "งั้นก็ดีแล้วเพราะครั้งนี้เราจำเป็นต้องจัดการให้เรียบ"
    mdt "ตุ้บๆๆๆๆ เสียงคนวิ่งเข้ามาหาทั้งคู่"
    show mosm:
        xalign 0.5
    m "พร้อมกันรึยางงงงง"
    show narasn:
        xalign 1.3 yalign 0.3
    n "ทั้งคู่พร้อมออกรบกันรึยัง?"
    p "แน่นอนผมทำใจมาหลายวันแล้วด้วย"
    hide mosm
    show mon:
        xalign 0.5
    j "ข้าเองก็พร้อมเสมอ !"
    m "งั้นเราเดินทางไปที่ราบที่พวกนั้นใกล้จะถึงกันเถอะ"
    n "อืม"
    hide narasn
    show narasan:
        xalign 1.3 yalign 0.3
    n "**ตะโกน** ทหารทุกคนเราจะออกเดินทางกันแล้ว"
    n "**ตะโกน** ขอให้เงียบที่สุดและระวังตัวให้ดี"
    n "**ตะโกน**เพราะเราต้องทำการรบใกล้หมู่บ้านและพลปืนเตรียมให้พร้อม"
    n "**ตะโกน**และฟัง ขุนสวรรค์ผู้นำของพวกเจ้าให้ดีอย่าได้ประมาท!!"
    hide mon
    hide narasan
    hide junn
    show ts2
    tss2 "รับทราบ!"
    hide ts2
    scene forest3day
    hide forest4
    mdt "หลังจากการเดินทางไปซักพัก ก็ได้ตกเย็น"
    p "**กระซิบ**นั่นไงแสงนั่นน่าจะเป็นทั้ตั้งค่ายของพวกมัน"
    show narasn:
        xalign -0.3 yalign 0.3
    n "**กระซิบ**งั้นรึเราต้องรอตกดึกและเข้าไปล้อมค่ายนั้นสินะ"
    show mon:
        xalign 0.5
    m "**กระซิบ**ดูเหมือนพวกมันยังตั้งค่ายเสร็จไม่ดีซะด้วย"
    m "**กระซิบ**เป็นโอกาสดีของเราแล้วล่ะ"
    show junn:
        xalign 1.0 
    j "**กระซิบ**พวกมันตั้งค่ายใกล้หมู่บ้านเราจริงๆ"
    j "**กระซิบ**หากทหารม้าวิ่งไปไม่นานก็น่าจะไปถึงหมู่บ้านเราแน่"
    j "**กระซิบ**ดีแล้วล่ะที่เราให้พวกเขาป้องกันไว้"
    j "**กระซิบ**เพราะเดี๋ยวต้องมีพวกที่คิดว่า หมู่บ้านเราไม่มีกองกำลังและส่งคนไปตีแน่ๆ"
    n "**กระซิบ**อืม ทหารทุกคนจำแผนได้นะ"
    n "**กระซิบ**บอกทุกคนด้วยว่าเราจะล้อมอย่างเงียบๆ"
    n "**กระซิบ**และรอสัญญาณของ [player_name] เพื่อบุกพร้อมกัน"
    hide narasn
    hide mon
    hide junn
    show ts2
    tss "**กระซิบ**ได้เดี๋ยวข้าจะไปบอกทุกคน"
    hide ts2
    show narasn:
        xalign 0.0 yalign 0.3
    n "**กระซิบ**[player_name] ว่าแต่เจ้าทำเจ้านั่นได้ยังไง ไอ้สิ่งที่เจ้าเรียกว่าพลุหน่ะ"
    p "**กระซิบ**มันก็คล้ายๆปืนใหญ่ขนาดเล็กที่มีแต่เสียงกับแสงเท่านั้นแหละ"
    p "[หวังว่ามันจะไม่ทำให้เกิดการผิดเพี้ยนของประวัติศาสตร์นะ]"
    p "[เพราะถ้าไม่ใช้เราคงทำแผนนี้ไม่สำเร็จ!]"
    show mon:
        xalign 1.0
    m "**กระซิบ**สุดยอดอย่างที่คิดเลยนะเจ้าเนี่ย"
    m "**กระซิบ**ทั้งแผนการรบ การประดิษฐ์ การฝึกฝน แถมตอนนี้ยังสู้รบพอได้อีกด้วย"
    p "**กระซิบ** อย่าชมผมขนาดนั้นเลย"
    p "**กระซิบ**ตอนนี้เรามาตั้งใจรอตกให้มือแล้วเตรียมล้อมค่าบพวกมันกันเถอะ"
    n "**กระซิบ**อืม!!"
    mdt "และเมื่อผ่านไปซักพักพระอาทิตย์ก็ได้ตกดินและแผนการก็เริ่มขึ้น"
    hide narasn
    hide mon
    mdt "และเมื่อผ่านไปซักพักพระอาทิตย์ก็ได้ตกดินและแผนการก็เริ่มขึ้น"
    scene forest3night
    hide forest3day
    p "**กระซิบ** เวลาประมาณนี้น่าจะล้อมกันหมดแล้วสินะ"
    j "**พยักหน้า**"
    scene firework
    hide forest3night
    mdt "ปัง!! เสียงพลุดังขึ้น"
    mdt "**และทุกคนก็ตะโกนออกมาพร้อมๆกัน** โอ้!!!!!!!"
    scene warscreen
    hide firework
    mdt "เป๊ง ๆๆๆ **เสียงดาบฟันกันอย่างหนักหน่วง**"
    show moan2 with vpunch:
        xalign 0.0
    m "นเรศ ระวัง !! **วิ่งไปเอาดาบขวาง**"
    n "ควับ ควั่บ **จัดการศูตรอย่างรวดเร็ว"
    show narasan with vpunch:
        xalign 1.0 yalign 0.3
    m "เรามาใช้ไอ้นั่นกันเถอะ! นเรศ!!"
    n "อืม!!!"
    hide moan2
    hide narasan
    scene fightw with vpunch
    mdt "และเธอก็ได้จัดการกับพงกทหารอย่างไปจำนวนมาก"
    #if heart_n or heart_m >2:
     #   jump cc
    #else:
     #   jump dead
    #label cc:
    hide warscreen
    scene warscreen
    hide fightw
    mdt "หลังจากผ่านการทำศึกไปซักพักชาวบ้านบางระจัน ก็ได้ชนะตามที่[player_name]ได้คาดการณ์ไว้"
    show narasan :
        xalign 0.0
    n "**ชูดาบขึ้นฟ้า**"
    tss2 "เฮ้!!!!!!!!!!!!!!!!!!!!!"
    show moan2:
        xalign 1.0
    m "เอาหล่ะทุกคนกลับไปที่หมู่บ้านกัน !"
    n "เฮ้!!!!!"
    mdt "หลังจากที่ทุกคนกลับมาถึงที่หมู่บ้านบางระจันด้วยความเหน็ดเหนื่อย"
    hide warscreen
    show villageday2
    show tvm1
    tss3 "พระนเรศวร !!!"
    tss3 "พระนเรศวร กลับมาแล้วแปลว่าเราชนะแล้ว!! "
    tss3 "ทุกคนเราชนะ!!!!"
    hide tvm1
    show tvm2:
        xalign 0.0
    tss4 "เฮ!!!!!!!!!!!!!!!!!!!"
    show tvfm1:
        xalign 1.0
    mdt "เสียงร้องดีใจของชาวบ้านที่ดังไปทั่วทั้งหมู่บ้าน ประกาศถึงชัยชนะที่ได้รับมา"
    hide tvfm1
    hide tvm2
    p "[เดี๋ยวนะพระนเรศศวร มันไม่ใช่ชื่อที่ควรอยู่สมัยนี้นี่ ทำไมถึงมาอยู่นี่ได้]"
    p "นเรศที่เขาบอกว่า… พระนเรศวรกลับมาแล้วนี่หมายความว่ายังไง?"
    show narasw:
        xalign 1.0 yalign 0.3
    n "ก็ข้าไงพระนเรศวร"
    p "ห๊ะ!"
    n "ตกใจอะไร?"
    p "ม่ะ.. ไม่มีอะไร [ฉันว่า….คงต้องเก็บเรื่องนี้ไปคิดที่กุติแล้วล่ะ]"
    hide narasw
    mdt "หลังจากทุกคนแยกย้ายไปพักผ่อนและรักษาแผล"
    scene kuti
    hide villageday2
    mdt "ในระหว่างที่พักในกุฏิ"
    p "รึว่า……."
    p "ทั้งสองคน"
    p "รึว่าทั้งสองคนจะไม่ใช่คนในยุคนี้"
    p "รึความเป็นจริงทั้งคู่จะไม่ได้เป็นคนของยุคนี้ เดี๋ยวคงต้องลองไปถามจันหนวดเขี้ยวดูแล้วล่ะ"
    mdt "----วันต่อมา---"
    scene base
    hide kuti
    show junn
    j "ฮืมมีอะไรรึ [player_name]"
    p "อ่า...คือ... พวก… โมและนเรศนี่เป็นคนของหมู่บ้านนี้แต่แรกหรือเปล่า?"
    j "ก็นะ ที่จริงข้าไปเจอพวกเธอที่ป่าแบบเจ้าเลยล่ะ"
    p "[งั้นแปลว่าพวกเธออาจจะโดนส่งมาด้วยอุปกรณ์คล้ายๆกับเราสินะ]"
    p "งั้นเหรอเข้าใจล่ะขอบคุณมากนะ จันหนวดเขี้ยว"
    j "ไม่เป็นไรหรอกว่าแต่เรื่องนั้นมันมีอะไรงั้นเหรอ? "
    p "ไม่มีอะไรหรอก แค่สงสัยนิดหน่อยหน่ะ!"
    hide junn
    show junsm
    j "งั้นเหรอเข้าใจล่ะ"
    hide junsm
    scene black
    hide base
    mdt "วันต่อมา"
    scene base
    hide black  
    show junn:
        xalign 0.0
    show mon:
        xalign 0.5
    show narasn:
        xalign 1.3 yalign 0.3
    mdt "[player_name]ได้เรียกทุกคนมารวมพล เพื่อที่จะคุยเกี่ยวกับแผนการรอบหน้า"
    p "ขอโทษที่ต้องเรียกรวมพลนะทุกคน"
    j "ไม่เป็นไรหรอกว่าแต่เจ้ามีอะไรล่ะว่ามาสิ"
    m "อื้มว่ามาสิ"
    p "จากที่คาดการณ์นะ เราได้ฆ่า"
    menu:#oop
            "แม่ทัพของทัพพม่ารามันไป":
                jump nice
            "พลทหารจำนวนมากของทัพพม่ารามันไป":
                $ heart_n -= 1 #ตัวแปรพวกนี้ต้องประกาศในoptionและใส่ไว้ตรงส่วนล่างสุดของoption
                $ heart_m -= 1
                if  heart_n <= 0:
                    $ heart_n = 0
                if  heart_m <= 0:
                    $ heart_m = 0
                jump sofool
    label nice:
        jump gocon
    label sofool:
        j "เจ้าหมายถึงแม่ทัพหรือเปล่า?"
        p "อ่านั่นแหละ ผมหมายถึงแม่ทัพ"
        jump gocon
    label gocon:
    p "ดังนั้นพวกมันน่าจะใช้เวลาซักพัก เพื่อที่จะสร้างความมั่นใจอีกครั้ง"
    p "ตามที่ผมคาดการไว้ก็ราวๆ15วัน [ตามที่เคยอ่านเจอในหนังสือล่ะนะ]"
    p "ดังนั้นช่วงนี้พักผ่อนกันให้เต็มที่และ จัดเวรยามให้ดีกว่าเดิมและระวังเรื่องข่าวสารหลุดด้วย"
    n "เข้าใจแล้วว่าแต่ทำไมเจ้าถึงมั่นใจใน เรื่องเวลาที่พวกมันจะใช้ขนาดนั้นล่ะ?"
    p "นั่นก็เป็นอีกเรื่องที่ผมต้องการตามทุกคนมาพูดด้วยนั่นแหละนะ"
    p "ความจริงคือ… ผม… ผม... ผมหน่ะมาจากอนาคต"
    hide mon
    hide narasn
    show mosa:
        xalign 0.5
    show narassa:
        xalign 1.3 yalign 0.3
    n "หมายความว่ายังไง? [player_name]"
    p "ผมหน่ะเป็นคนที่เกิดหลังจากยุคนี้"
    p "หลังจากพวกนายตายไปแล้วหลายร้อยปี แต่ด้วยเจ้าของตรงแขนนี่"
    p "ทำให้ผมกลับมาในช่วงเวลานี้ได้ซึ่งผมมาโดยบังเอิญ"
    j "อืมข้าก็คิดอยู่แล้วว่าเจ้านั่นแปลกๆ งั้นแบบนี้ก็ตรงกับที่ข้าคิดไว้"
    j "เพราะเข้าทั้งนำพาพวกเราและ สร้างอุปกรณ์ใหม่ที่ไม่เคยมีใครเห็น"
    j "โดยการประยุกต์ของง่ายๆขึ้นมามัน ไม่ใช่เรื่องที่คนปกติจะทำได้หลอกนะ"
    hide mosa
    show mocu:
        xalign 0.5
    m "งะ..งั้นเหรอข้าคิดว่ามันเป็นเพราะ [player_name]ฉลาดกว่าคนอื่นเท่านั้นเอง  "
    n "ข้าเองก็คิดเช่นนั้น"
    p "แปลว่าพวกเจ้าเชื่อแล้วผมสินะ "
    j "ก็ไม่มีเหตุผลที่เจ้าต้องโกหกนี่"
    hide mocu
    hide narassa
    show mosm:
        xalign 0.5
    show narassm:
        xalign 1.3 yalign 0.3
    mAndn "อื้มพวกข้าเชื่อเจ้านะ[player_name]"
    p "ขอบคุณนะที่เชื่อผมและอีกเรื่องนึง"
    p "ผมคิดว่าโม และ นเรศเองก้มาจากอนาคตเหมือนกัน"
    hide mosm
    hide narassm
    show moan1:
        xalign 0.5
    show narassa:
        xalign 1.3 yalign 0.3
    p "เท่าที่ผมจำได้พวกเธอมีตัวตนอยู่ในอีกยุคสมัย"
    p "แต่กลับหายตัวไปในช่วงวัยรุ่น"
    p "และพวกเธอยังมาโผล่ในป่าใกล้ๆ เมืองเหมือนกับตอนที่ผมโผล่มาด้วย"
    hide mosm
    hide narassm
    show mosa:
        xalign 0.5
    show narassa:
        xalign 1.3 yalign 0.3
    mAndn "เจ้าคิดงั้นรึ งั้นมันก็อาจจะเป็นจริง"
    p "เพราะงั้นผมเลยคิดว่าผมจะต้อง ส่งพวกคุณกลับไปที่ยุคเดิมหน่ะสิ"
    n "แต่จะให้ทิ้งทุกคนในหมู่บ้านนี่นะ"
    m "ใช่แล้วไม่เอาหรอกนะ!"
    p "ไม่ได้หมายความว่าตอนนี้ซักหน่อย แต่เป็นหลังจากสงครามจบต่างหาก"
    p "ซึ่งการรบครั้งต่อไปจะเป็นครั้งสุดท้าย แล้วล่ะถ้าทำตามแผนของผม"
    mAndn "เอางั้นก็ได้พวกข้าเชื่อเจ้านะ"
    p "ขอบคุณนะ"
    j "แล้วข้าล่ะมาจากยุคอื่นรึเปล่า**ตื่นเต้นสุดๆ**"
    p "เจ้าหน่ะเป็นคนยุคนี้อย่างแท้จริงเลยล่ะนะ ฮ่าๆๆๆ"
    mdt "และทุกคนก็แยกย้ายกันไปจนเหลือแค่ [player_name]และจันหนวดเขี้ยว"
    hide narassa
    hide mosa
    hide junn
    show junn:
        xalign 0.0
    mdt "เปรี๊ย"
    p "[เสียงมันส่งมาจากนาฬิกานี่]"
    p "[อย่าเพิ่งพังซะล่ะเพราะอุปกรณ์ในยุคนี้ ยังเอามาซ่อมเจ้านาฬิกาย้อนเวลาได้ด้วยซ้ำ]"
    mdt "ตึกๆๆๆ**เสียงวิ่งเข้ามาที่เร่งรีบ**"
    show tvm1:
        xalign 1.0
    tss "จันหนวดเขี้ยวแย่แล้วข้าได้ข้อมูลจากหน่วยสอดแนม"
    tss "พวกพม่ามันมาเร็วมากเร็วที่พวกเราคาดการไว้มาก"
    p "น่าจะประมาณครึ่งเดือนหน่ะ"
    j "แล้วทางเมืองหลวงล่ะเราได้ข่าวอะไรไหม"
    j "กำลังเสริมรึปืนใหญ่พวกเขาว่าเช่นไร!!"
    tss "ระ เรายังไม่ได้ข่าวอะไรจากทางเมืองหลวงเลย"
    p "ไม่เป็นไรหรอกจันพวกเราเอาอยู่น่า"
    p "[บ้าเอ๋ยนี่มันแย่กว่าที่คิดไว้อีกนะเนี่ย ทำไมพวกพม่ารามัญมันถึงมาได้ไวขนาดนี้ล่ะ]"
    p "[มันแปลกจากที่เรารู้มานี่ปกติแล้วบางระจัน ไม่น่ารู้ข่าวว่ากองทัพพม่าจะมาเร็วขึ้นนี่นา]"
    p "[เพราะตามที่เราศึกษาพวกพม่ารามัญมันไม่มีทาง ปล่อยให้ข่าวการเดินทัพครั้งนี้หลุดได้เลย]"
    hide junn
    hide tvm1
    mdt "และเวลาก็ได้ผ่านไปซักพัก"
    scene kuti
    hide base
    p "วันพรุ่งนี้แล้วสินะที่เราต้องสู้อีกครั้ง"
    p "วันนี้ผมรีบไปปรึกษาเรื่องแผนการกับพวกจันหนวดเขี้ยวก่อนดีกว่า"
    mdt "**เดินทางไปไปหาจันหนวดเขี้ยว**"
    scene base
    hide kuti
    show junn:
        xalign 0.0
    j "ว่าไง [player_name]เราส่งทหารไปเตรียมทัพ แล้วนะแต่เราไม่น่าจะเตรียมการทันนะ!"
    p "งั้นเหรอ...แต่ไม่เป็นไรหรอก แล้ว นเรศ และ โมล่ะ"
    j "พวกเธอกำลัง อ๊ะมานั่นแล้วไง"
    mdt "ในตอนนั้นเองโม และ นเรศก็เดินเข้ามา"
    show mon:
        xalign 0.5
    show narasn:
        xalign 1.3 yalign 0.3
    n "อ้าว[player_name]มีอะไรงั้นเหรอ"
    p "จริงๆก็ไม่มีอะไรเร่งด่วนหรอก"
    p "แค่อยากรู้ว่าเราเตรียมการตามแผนการถึงไหนแล้วหน่ะ"
    m "ก็เป็นไปตามแผนนะถ้าไม่ผิดคาด เราน่าจะต้านทัพของพวกมันไหว"
    n "แล้วทางเจ้าล่ะ[player_name] เรื่องช่วงเวลาของพวกเราที่ต้องส่งกลับหน่ะเจ้ารู้หรือยัง"
    p "คิดว่าได้แล้วหน่ะหลังจาก ลองใช้ฟังก์ชั่นตามหาบุคคนแล้ว"
    p "ก็ได้ช่วงเวลาที่พวกเธอจากมาแล้วล่ะ"
    p "[ดีนะที่ทำเผื่อไว้เพราะคิดไว้อยู่แล้วว่า มันต้องมีคนที่เอาอะไรจากอดีตไปในช่วงเวลาอื่นแน่ๆ]"
    hide mon
    hide narasn
    show mosa:
        xalign 0.5  
    show narassa:
        xalign 1.3 yalign 0.3
    mAndn "**ทำหน้าเศร้าๆ**"
    m "งั้นเหรองั้นก็ดีแล้วล่ะ"
    p "ผมเข้าใจนะว่าทั้งสองคนไม่อยากไปจากที่ตัวเองเคยอยู่มา"
    p "แต่ยังไงทั้งสองคนก็ต้องไปนะไม่งั้น ประวัฒศาสตร์ในยุคของผมมันจะผิดเพี้ยนไปทั้งหมดเลยหน่ะสิ"
    n "ถึงข้าจะอยากรู้เรื่องในอนาคตแต่ข้าก็ไม่ควรถามสินะ"
    p "อืมถ้าพวกเจ้ารู้ “มันก็จะไม่เกิดขึ้น”"
    hide mosa
    hide narassa
    show mosm:
        xalign 0.5
    show narassm:
        xalign 1.3 yalign 0.3
    m "งั้นก็ช่างมันเถอะเรื่องของอนาคตเรามาทำตอนนี้ให้ดีที่สุดก็พอเนาะ !!"
    hide junn
    show junsm:
        xalign 0.0 
    j "ข้าก็ว่าอย่างนั้นแหละ"
    show black with fade
    hide junsm
    mdt "วันต่อมา"
    mdt "**แปร๊นนนนน** เสียงแตรศึกของฝ่ายพม่าได้ดังขึ้น"
    hide bese
    scene warscreen
    hide black
    p "ระวังตัวกันด้วยนะพวกนายหน่ะ!!"
    mdt "แป๋งๆๆๆๆ **เสียงดาบฟันกัน**"
    show junan:
        xalign 0.0
    show moan2:
        xalign 0.5
    show narasan:
        xalign 1.3 yalign 0.3
    mjn "ไม่ต้องห่วงเป็นห่วงตัวเองเถอะ!!"
    p "เข้าใจแล้ว !"
    mdt "เปรี๊ยๆๆๆๆๆๆๆๆๆๆๆๆๆๆ"
    p "นะ นาฬากาย้อนเวลมันเริ่มช็อตหนักแล้วสิ!"
    p "โม นเรศเราต้องย้อนเวลาเดี๋ยวนี้ก่อนที่นาฬิกาจะพัง!"
    m "แต่ว่าสงครามมันยัง!!!!"
    hide junan
    show junn:
        xalign 0.0
    hide narasan
    show narasan with hpunch:
            xalign 1.3 yalign 0.3
    n "เราหน่ะทิ้งชาวเมืองไม่ได้หรอกนะ"
    n "โม!!"
    hide moan2
    show moan2 with hpunch:
            xalign 0.5
    m "อื้ม!!"
    scene fightw with vpunch
    hide  warscreen
    p "ถือว่าผมขอร้องนะได้โปรดกลับเถอะ!!"
    scene warscreen
    hide fightw
    jump chosse
    label chosse:
        if heart_m <= 2 and heart_n <= 2:
            jump badend
        else :
            jump goodend
    label goodend:
        hide junan
        hide moan2
        hide narasan
        scene jfw with fade
        j "พวกเจ้าทั้งสองคนไปเถอะ!"
        if heart_m > heart_n:
            jump morote
        elif heart_n > heart_m:
            jump naresrote
    label naresrote:
        show mosa with vpunch:
            xalign 0.5
        m "จะบ้าหรอ!.....จะให้ทิ้งจันไว้…."
        show narassa with hpunch:
            xalign 1.3 yalign 0.3
        n "โม.......เราต้องเชื่อ[player_name]อนาคตประเทศชาติต้องมาก่อนสิ "
        m "จัน...เจ้า…ไหวนะ"
        j "ไม่ต้องห่วงน่า ข้าไม่ตายหรอก"
        scene jfw with hpunch
        j "เดี๋ยวข้าจะต้านพวกมันไว้เอง!!!"
        p "มาเถอะทั้งสองคน"
        m "ตะ แต่ว่า!"
        jump goodend2
    label morote:
        show narassa with vpunch:
            xalign 1.3 yalign 0.3
        n "ละ…..แล้ว…..จันหละ…."
        show mosa with hpunch:
            xalign 0.5
        m "นเรศ…...บ้าเอ้ย…...ถึงจะไม่ชอบก็เถอะ แต่เราต้องเชื่อใจใน[player_name]ไม่งั้นลูกหลานเราแย่แน่"
        m "ข้าพูดถูกไหม [player_name]"
        p "อื้มขอบใจเธอมากนะ….. โม"
        scene jfw with hpunch
        j "เดี๋ยวข้าจะต้านพวกมันไว้เอง!!!"
        p "มาเถอะทั้งสองคน"
        n "ตะ แต่ว่า!"
        jump goodend2
    label goodend2:
        j "จันหนวดเขี้ยว:ข้าบอกให้ไปก็ไปซะ!!!! อย่าให้ต้องพูดอีกรอบ!"
        mAndn "ข เข้าใจแล้ว"
        p "จับมือผมมือกับแขนผมไว้เร็ว!!"
        mAndn "อ่ะ อื้ม!!"
        hide mosa
        hide narassa
        scene Timetravel
        hide jfw
        show mosa:
            xalign 0.0
        show narassa:
            xalign 1.0 yalign 0.3
        p "โมเธอต้องไปตรงนี้!!!"
        p "ส่วน นเรศเธอทางนี้!!"
        m "ลาก่อนนะทั้งสองคนหวังว่าเราจะได้เจอกันอีก"
        n "ลาก่อนนะทั้งสองคน"
        if heart_m > heart_n:
            jump morote2
        elif heart_n > heart_m:
            jump naresrote2 
    label naresrote2:
        hide narassa
        show narasw:
            xalign 1.0 yalign 0.3
        n "ข้ารักเจ้านะ[player_name] อย่างน้อยๆก่อนจากไปข้าก็อยากบอกเจ้าไว้"
        p "ขะ..ขอบคุณนะจริงๆแล้วข้าเองก็ชอบเจ้านะ  นเรศ!"
        n "หวังว่าเราจะมีโอกาสได้พบกันอีกนะ**ร้องไห้สะอื้น**"
        jump goodending
    label morote2:
        hide mosa
        show mosa:
            xalign 0.0
        m "ข้ารักเจ้านะ[player_name] อย่างน้อยๆก่อนจากไปข้าก็อยากบอกเจ้าไว้"
        p "ขะ..ขอบคุณนะจริงๆแล้วข้าเองก็ชอบเจ้านะ โม!"
        m "หวังว่าเราจะมีโอกาสได้พบกันอีกนะ**ร้องไห้สะอื้น**"
        jump goodending
    label goodending:
        hide mosa
        hide narasw
        hide narassa
        mdt "และทั้งคู่ก็จากไป"
        mdt "และ[player_name]ก็กลับมาถึงในยุคปัจจุบัน ณ ช่วงเวลาเดิม"
        scene oldlab
        hide Timetravel
        mdt "แต่ที่นั่น ไม่มีตำรวจหรือเหล่าคนของพม่าอีกแล้ว"
        p "อ่ะ เอ๋! ทำไม ไม่มีใครมาจับเราล่ะ "
        p "แถมยัง **วิ่งออกไปข้างนอก**"
        mdt "ตึกๆๆๆๆๆๆๆ"
        scene cityft
        hide oldlab
        p "ที่นี่มัน มีแต่ภาษาไทย ทุกที่เลย"
        p " ไทย ! ที่นี่ประเทศไทยล่ะะะะะะะะะะะ"
        jump ending
    label badend:
        hide moan2
        hide narasan
        show moan2:
            xalign 0.5
        show narasan with vpunch:
            xalign 1.3 yalign 0.3
        mAndn "เจ้าบ้ารึเปล่า!!!!"
        m "หน้าสิ่วหน้าขวานขนาดนี้เจ้ายังจะให้หนีอีกหรอ"
        hide moan2
        show moan1:
            xalign 0.5
        m "เจ้ามันขี้ขลาดดดดด!!!!!!!"
        hide narasan
        show narassa:
            xalign 1.3 yalign 0.3
        n "ข้าผิดหวังในจิตใต้สำนึกเจ้ามากนะ[player_name]"
        n "เจ้ายังเป็นคนไทยอยู่ไหม"
        p "แต่ถ้าพวกคุณไม่ไปตอนนี้ เราอาจจะไม่ได้กลับอีกแล้วนะ!!!!"
        p "แล้วอนาคตหละ!!!!!!"
        hide moan1
        show moan2 with vpunch:
            xalign 0.5
        m "ช่างอนาคตเจ้าสิ!!!!!"
        n "ถ้าเจ้ากลัวตายขนาดนั้นเจ้าก็กลับไปคนเดียวเถอะ"
        n "พวกข้าจะช่วยจันสู้เอง"
        hide narassa
        hide moan2
        hide junn
        mdt "ทั้งสามคนไปสู้ต่อและทิ้ง[player_name]ไว้ข้างหลัง"
        p "ไม่นะ….โถ่เว้ยยยย!!!"
        p "[มันเกิดอะไรขึ้นวะเนี่ยยยย…]"
        p "[…...คิดสิ คิด ต้นเหตุช่องโหว่เวลานี้คืออะไร!!!]"
        p "[ข้อความที่ส่งมานั้น….อยากให้เราทำอะไร]"
        p "อ่ะ!"
        p "[ใช่แล้ว เราประติดประต่อเรื่องได้แล้ว!]"
        p "[นเรศ โม รอก่อนนะเดี๋ยวฉันกลับมาช่วย]"
        mdt "กดเครื่องข้ามเวลา"
        hide warscreen
        scene Timetravel with fade
        p "ที่ที่ต้องไป มีที่เดียวเท่านั้น!!!!"
        scene Vlab with fade
        hide Timetravel
        p "แย่ละ…..เครื่องย้อนเวลาพังซะแล้ว"
        show pol with vpunch:
            xalign 0.5
        po "หยุด!! หมอบลงไปกับพื้น(ภาษาพม่า)"
        p "[รู้ได้ไงว่าเราจะมาหน่ะ!?]"
        hide pol
        show pol at left with move
        show mmv2 at right with move
        dkp "แหม่ๆ หัวไวจังเลยนะคุณคนอัจริยะ"
        p "อึก!![]ไอหมอนี่มันพูดไทยได้"
        dkp "ยินดีต้อนรับสู่ศูนย์วิจัยเอกชนชั้นนำ แห่งสาธารณรัฐแห่งสหภาพเมียนมาร์ "
        dkp "ผมหัวหน้าโปรเจคการย้ายมวลสารข้ามเวลา….."
        p "รู้ได้ไงว่าฉันจะมา"
        hr "โว้วๆ ใจเยนก่อนสิ ไม่รอผมแนะนำตัวเสรจเลย"
        mdt "และ หัวหน้านักวิจัยก็ได้ถอดหน้ากากออก"
        hide mmv2
        show mmv6 at right
        p "ยังมีหน้ามาทำใสซื่ออีก"
        p "ก็แกไม่ใช่หรอ ที่ส่งข้อความให้ชั้นย้อนเวลาไปอดีต ไปช่วยบางระจัน"
        p "แกรู้ว่าชั้นได้ข้อความนี้แล้วชั้นจะต้องไปที่นัน"
        p " แล้วแกก็ยังส่งโม กับ นเรศ มายุคบางระจันอีก"
        p "ทำให้พวกเขาไม่สามารถนำทัพ ต่อกรกับทัพพม่าในเวลาที่ควรจะเป็น"
        hide mmv6
        show mmv7 at right
        p "แล้วที่ทัพพม่าเคลื่อนทัพเรวกว่ากำหนดหน่ะ "
        p "ฝีมือแกใช่ไหม"
        p "ตอนแรกก็ไม่เอะใจอะไรหรอกแต่"
        p "ทุกครั้งที่เข้าใกล้โมกับนเรศ เครื่องย้อนเวลาของฉันก็เกิดปฏิกริยา"
        p "ซึ่งพอฉันตรวจกระแสคลื่น ก็รู้ว่ากระแสคลื่นมันมาจากที่เดียวกัน.."
        p "มันนำทางฉันมาหาแก เจ้าคนพม่าเฮงซวย!"
        hr "ถือว่าฉลาดมากนะครับที่รู้ทัน เก่งมากเลยนะครับ"
        p "ทำแบบนี้ทำไม ประเทศแกตอนนี้ยังไม่เจริญพออีกหรอ!"
        hr "เพราะก่อนหน้านี้มันไม่ใช่อย่างที่เป็นไงหล่ะ"
        hr "จริงๆแล้วประเทศไทยหน่ะเจริญ กว่าพม่าเยอะพอสมควรนะรู้ไหม"
        hr "ตอนที่ประเทศพวกแกยังอยู่ในแผนที่โลก พวกแกก็ไม่ต่างอะไรกับพวกชั้นตอนนี้เลย"
        hr "ดูถูก…..เหยียดหยาม!"
        hide mmv7
        show mmv8 at right
        hr "เฮงซวยหน่ะ คือคำพูดของทางนี้เว้ย"
        p "ก...แก… ทำได้ยังไงกัน"
        hide mmv8
        show mmv7 at right
        hr "จะเล่าให้แกฟังหน่อยก็ได้…"
        hr "แผนฉันมันก็เหมือนกับ easter egg นั้นแหละ"
        hr "ที่ใครก็ตามที่ฉลาดมากพอ ก็จะเจอกับมัน"
        hr "เอกภพนี้หน่ะมันมีสิ่งที่ควบคุมระดับเหตุการณ์ ต่างๆ"
        hr "เป็นเส้นตรง เรียกว่า มิติแห่งเส้นเวลาอยู่"
        hr "ใช่….แกพูดถูกที่ฉันเอากษัตริย์ และคนจากต่างยุคต่างสมัยมา"
        hr "แล้วฉันเลยใส่ข้อความโง่ๆลงไปในมิติแห่งเส้นเวลา…"
        hr "ใครที่ฉลาดพอที่จะเข้าถึงมิติเส้นเวลาได้"
        hr "ก็จะเจอข้อความ แค่นั้นเอง"
        hr "พูดง่ายๆนะคือเพราะแกสร้างเครื่องย้อนเวลาได้"
        hr "แกเลยเห็นข้อความของฉันไงหล่ะ!"
        hide mmv7
        show mmv6 at right
        hr "ทีนี้…ฉันก็แค่ไปเป่าหูแม่ทัพพม่า ให้ทำตามคำแนะนำของฉัน"
        hr "ให้รู้จุดอ่อนของทัพไทย ก็แค่นั้น"
        hr "จริงๆ ฉันกะว่าจะหลอกแกให้ช่วยรบในศึกที่ 8"
        hr "แล้วตายไปกับพวกบางระจันแล้วนะเนี่ย"
        hr "ถึงจะผิดแผนไปหน่อย "
        hr "แต่ยังดีที่ฉันเตรียมให้ตำรวจมาเฝ้าที่นี่ไว้"
        hr "ตามแผนที่ฉันวางไว้ หึหึหึหึ"
        p "อึก……"
        hr "เอาหละ… ยังสงสัยอะไรอยู่ไหมพ่อยอดนักสืบ"
        hide mmv6
        show mmv8 at right with vpunch
        hr "เฮ้ย….พวกแกหนะ(ภาษาพม่า)"
        hr "เก็บมันซะ!!!!…(ภาษาพม่า)"
        hr "ฉันจะไปเตรียมการวางแผนรับมือ พวกไทยใต้ดินคนอื่นๆอีก(ภาษาพม่า)"
        hide mmv8
        show mmv7 at right with vpunch
        hr "แล้วเจอกันนะ [player_name]........."
        scene black with fade
        play sound "gunshort.mp3" #sound:https://www.fesliyanstudios.com/
        
        jump ending
        
    label dead:
        scene ggwp
        jump ending
    label ending:
    # This ends the game.
    return
